Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: As such, by the first upload of an architecture-specific package which should not be built on other architectures, a build attempt is tried none the less (but fails even before the build-time dependencies are downloaded and/or installed)
pt_pt: Desse modo, quando ocorre o primeiro upload de um pacote de arquitetura específica que não deve ser construído em outras arquiteturas, uma tentativa de construção é ainda assim realizada (mas falha mesmo antes que as dependências de tempo de construção sejam baixadas e/ou instaladas).

source: Since autobuilders should not waste time trying to build packages that aren't required for their architecture, there's need for a way to list packages for which even an attempt to build isn't required.
pt_pt: Já que os autobuilders não devem perder tempo tentando construir pacotes que não são requisitados para sua arquitetura, não existe necessidade de uma listagem de pacotes os quais uma única tentativa de construção não é requerida.

source: The first solution to this problem was not-for-us; however, as that is difficult to maintain, not-for-us is deprecated nowadays; autobuilder maintainers should use packages-arch-specific instead, which is a list of packages specific to one or more architectures instead of a wanna-build state.
pt_pt: A primeira solução para este problema foi o not-for-us; contudo, como é difícil de manter, o not-for-us está atualmente obsoleto; mantenedores(as) de autobuilders devem usar packages-arch-specific, que é uma lista de pacotes específicos para uma ou mais arquiteturas em vez de um estado wanna-build.

source: A package in not-for-us or packages-arch-specific will not leave this state automatically; if your package specifically excluded a given architecture in its control file previously, but now includes more architectures, it must be manually requeued.
pt_pt: Um pacote em not-for-us ou packages-arch-specific não sairá deste estado automaticamente; se previamente seu pacote excluiu uma dada arquitetura em seu arquivo control, mas agora inclui mais arquiteturas, ele deve ser manualmente recolocado na fila.

source: If you ever find yourself in the position that you have to ask for this to happen, you can do so by asking the relevant buildd maintainer.
pt_pt: Se alguma vez você se encontrar em uma posição em que tenha que pedir para que isto aconteça, você deve fazê-lo perguntando ao(à) mantenedor(a) do buildd relevante.

source: They can be reached at $arch@buildd.debian.org.
pt_pt: Eles(as) podem ser encontrados(as) em $arch@buildd.debian.org.

source: As the name suggests, a package marked installed is compiled for the architecture the wanna-build database is for.
pt_pt: Como o nome sugere, um pacote marcado com installed (instalado) está compilado para a arquitetura apontada pelo banco de dados wanna-build.

source: Before Woody was released, a package's state changed from uploaded to installed after the daily katie runs.
pt_pt: Antes do Woody ter sido lançado, um estado de pacote mudava de uploaded para installed após a execução diária do katie.

source: With the implementation of Accepted-autobuild, however, this is no longer true; nowadays, a package goes from state uploaded to installed when it is accepted into the archive.
pt_pt: Com a implementação do Accepted-autobuild, contudo, isto não é mais verdade; hoje em dia, um pacote vai do estado uploaded para installed quando ele é aceito no repositório.

source: This means that a package is usually marked installed after 15 minutes, on average.
pt_pt: Isto significa que um pacote é geralmente marcado como installed após 15 minutos, na média.

source: In addition to these eight states, wanna-build also knows two -removed states, which are really corner cases.
pt_pt: Além desses oito estados, o wanna-build também conhece dois estados -removed, que realmente são casos excepcionais.

source: These two states are dep-wait-removed and failed-removed.
pt_pt: Esses dois estados são dep-wait-removed e failed-removed.

source: They relate to their respective plain state as follows: when a package in state failed or dep-wait doesn't appear in a new Packages file which is fed to wanna-build – when it appears it has been removed – the information about that package isn't thrown away, as it could be that the package not appearing in the Packages file is just a temporary glitch, or that the package is temporarily removed for some reason (but that it will reappear in the archive, given time).
pt_pt: Eles se relacionam aos seus respectivos estados normais dessa forma: quando um pacote no estado failed ou dep-wait não aparece em um novo arquivo Packages, que é alimentado para wanna-build – quando aparece, já foi removido – a informação sobre aquele pacote não é jogada fora como poderia ser feito, já que o pacote que não aparece no arquivo Packages é somente uma pequena falha temporária, ou aquele pacote foi temporariamente removido por alguma razão (mas vai reaparecer no repositório depois de algum tempo).

source: Instead, in such a case, a package is moved to a -removed state, so that the information on why it failed or what it's waiting for can be retained.
pt_pt: Em vez disso, em tal caso, um pacote é movido para um estado -removed para que a informação sobre o porquê ele falhou ou o que está aguardando possa ser retida.

source: Should the package reappear in a following Packages file which is fed to wanna-build, it will then be moved from failed-removed back to failed, or from dep-wait-removed back to dep-wait before further processing.
pt_pt: Caso o pacote reapareça em um próximo arquivo Packages que é alimentado no wanna-build, ele então será movido de volta de failed-removed para failed, ou de volta de dep-wait-removed para dep-wait antes de novos processamentos.

source: It is not possible to access the wanna-build database directly; this database is installed on ftp-master.debian.org, which is a restricted host, and only autobuilders have an SSH key which allows them to access the wanna-build database of their architecture.
pt_pt: Não é possível acessar o banco de dados wanna-build diretamente; este banco de dados é instalado em ftp-master.debian.org, que é um host restrito, e somente autobuilders tem uma chave SSH que permite que eles acessem o banco de dados wanna-build para suas arquiteturas.

source: This has been the case even before ftp-master was restricted; As wanna-build does a database-level lock when accessing, even reading, the data, you had to be in the right group (wb-<arch>) to be able to directly access a wanna-build database.
pt_pt: Isto tem sido a norma desde antes de ftp-master ter sido restringido; como o wanna-build faz um bloqueio em nível de banco de dados quando acessado, mesmo na leitura de dados, você tem que estar no grupo correto (wb-<arch>) para ser capaz de acessar diretamente um banco de dados wanna-build.

source: That said, you can see what state a package is in by going to the buildd stats page, except if it is in state installed (well, not unless you don't mind digging through the multi-megabytes "<arch>-all.txt" files...).
pt_pt: Dito isso, você pode ver qual estado um pacote está na página de estatísticas do buildd, exceto se ele está no estado installed (bem, é possível, se você não liga de escavar multimegabytes através de arquivos "<arch>-all.txt" ...).

source: The build log results
pt_pt: Os resultados do log de construção

source: When a package is built by sbuild (the buildd component which does the actual building), a log with the build result is sent, by mail, to the autobuilder admin and to logs@buildd.debian.org (so that it can end up at https://buildd.debian.org).
pt_pt: Quando um pacote é construído por sbuild (o componente do buildd que realmente faz a construção), um log com o resultado da construção é enviado, por e-mail, para a administração do autobuilder e para logs@buildd.debian.org (de modo que ele chegue até https://buildd.debian.org).

source: The build log result can be one of successful, attempted (previously known as failed), given-back, or skipped.
pt_pt: O resultado do log de construção pode ser successful, attempted (antes conhecido por failed), given-back ou skipped.

source: Note that, at the buildd log overview page, the prefix maybe- is added, because among other things, the fact that a build can be marked failed there for things that aren't really a failure has caused confusion in the past (or, the other way around, sometimes a package which apparently built successful is really broken and needs to be rebuilt).
pt_pt: Note que na página de síntese do log do buildd, o prefixo maybe- é adicionado, porque entre outras coisas, o fato de que uma construção possa ser marcada com failed para coisas que não são realmente uma falha causou confusão no passado (ou, por outro lado, algumas vezes um pacote que aparentemente construiu com sucesso está realmente quebrado e precisa ser reconstruído).

source: The meaning of the log results is as follows:
pt_pt: O significado dos resultados do log estão a seguir:

source: The build was successful.
pt_pt: A construção foi bem sucedida.

source: When the autobuilder maintainer receives this log, he will extract the embedded .changes file, sign it, and send it back to the autobuilder, which will cause the package to be uploaded.
pt_pt: Quando o(a) mantenedor(a) do autobuilder recebe este log, ele(a) extrairá o arquivo .changes embutido, assinará e o enviará de volta para o autobuilder, que fará o upload do pacote.

source: attempted (previously: failed)
pt_pt: attempted (antes: failed)

source: The build exited with a non-zero exit state, indicating it probably failed.
pt_pt: A construção terminou com um estado de saída não zero, indicando que provavelmente falhou.

source: As there can be a number of reasons why a build fails, enumerating all them would be tedious, so no attempt is done here.
pt_pt: Como pode haver um bom número de razões da falha da construção, enumerá-las todas seria tedioso, então não vamos tentar fazer isso aqui.

source: If a package of yours is marked (maybe-)failed, you will want to read the above, and check its current wanna-build state.
pt_pt: Se um pacote seu está marcado com (maybe-)failed, você vai querer ler o que escrevemos acima e verificar o atual estado wanna-build.

source: The build failed due to a temporary problem with the autobuilder; examples include network problems, the unavailability of the packages' source with the current sources.list, low disk space, and others.
pt_pt: A construção falhou devido a um problema temporário com o autobuilder; exemplos incluem problemas de rede, a indisponibilidade do fonte do pacote com o atual sources.list, pouco espaço em disco, e outros.

source: A package which is given-back is marked as needs-build again; as such, it will be automatically picked up by a different autobuilder once one is ready.
pt_pt: Um pacote que está com given-back é marcado com needs-build novamente; como tal, ele será automaticamente escolhido por um autobuilder diferente quando estiver pronto.

source: In the time between the package was picked by the/an autobuilder and marked building and the build attempt, a new version for this package was uploaded, or a porter manually modified the wanna-build state for another reason.
pt_pt: No período entre o pacote ter sido escolhido por um autobuilder e marcado com building, e a tentativa de construção, uma nova versão para este pacote foi enviada, ou a equipe de porte manualmente modificou o estado wanna-build por alguma outra razão.

source: When that is done, a mail is sent to the autobuilder, which will mark the package as not to be built; sbuild sees this, and will skip the build (although a build log with this result is sent, describing the fact that this happened).
pt_pt: Quando estiver pronto, um e-mail é enviado para o autobuilder, que marcará o pacote para não ser construído; o sbuild verá e ignorará a construção (embora o log de construção com este resultado seja enviado, descrevendo o fato que fez isso acontecer).

source: The graphical version
pt_pt: A versão gráfica

source: To illustrate the above, we have also provided a flowchart-version of this procedure.
pt_pt: Para ilustrar o que foi escrito acima, nós também providenciamos uma versão-fluxograma deste procedimento.

source: Again, note that it does not contain everything mentioned in this document.
pt_pt: Novamente, note que ele não contém tudo o que foi mencionado neste documento.

source: Last Modified: Thu, Oct 5 09:32:45 UTC 2023 Last Built: Tue, Aug 6 19:40:17 UTC 2024
pt_pt: Última Modificação: Dom, 8 de Out de 2023, 01:53:30 UTC Última compilação: Ter, 6 de Ago de 2024, 22:04:38 UTC

source: Debian Developers' Corner / Debian-Accessibility / Debian-Accessibility - Software
pt_pt: Canto dos(as) desenvolvedores(as) Debian / Debian-Acessibilidade / Debian-Acessibilidade - Software

source: Debian-Accessibility - Software
pt_pt: Debian-Acessibilidade - Software

source: Speech Synthesis and related APIs
pt_pt: Síntese de fala e APIs relacionadas

source: A thorough list is available on the speechsynthesis task page
pt_pt: Uma lista minuciosa está disponível na página da tarefa speechsynthesis

source: A speech server for Emacspeak and yasr (or other screen readers) that allows them to interface with Festival Lite, a free text-to-speech engine developed at the CMU Speech Center as an off-shoot of Festival.
pt_pt: Um servidor de fala para o Emacspeak e o yasr (ou outros leitores de tela) que os permite fazer interface com o Festival Lite, um motor livre para conversão de texto em fala desenvolvido pelo CMU Speech Center como um derivado do Festival.

source: Due to limitations inherited from its backend, EFlite does only provide support for the English language at the moment.
pt_pt: Devido a limitações herdadas de seu backend, o EFlite somente provê suporte para a língua inglesa no momento.

source: eSpeak/eSpeak-NG is a software speech synthesizer for English, and some other languages.
pt_pt: O eSpeak/eSpeak-NG é um software sintetizador de fala para o inglês e alguns outros idiomas.

source: eSpeak produces good quality English speech.
pt_pt: O eSpeak produz fala em inglês de boa qualidade.

source: It uses a different synthesis method from other open source text to speech (TTS) engines (no concatenative speech synthesis, therefore it also has a very small footprint), and sounds quite different.
pt_pt: Ele usa um método de síntese diferente de outros motores de texto para fala (TTS - text to speech) de código aberto (sem síntese de fala por concatenação, portanto ele deixa pouco vestígio), e soa bem diferente.

source: It's perhaps not as natural or smooth, but some find the articulation clearer and easier to listen to for long periods.
pt_pt: Talvez não seja tão natural ou suave, mas algumas pessoas acham a articulação mais clara e fácil de ouvir por longos períodos.

source: It can run as a command line program to speak text from a file or from stdin.
pt_pt: Ele pode ser executado via programa de linha de comando para falar texto de um arquivo ou da entrada padrão (stdin).

source: It also works well as a Talker with the KDE text to speech system (KTTS), as an alternative to Festival for example.
pt_pt: Ele também funciona como um Talker (sintetizador de voz) com o sistema de texto para fala do KDE (KTTS - KDE text to speech) como uma alternativa ao Festival, por exemplo.

source: As such, it can speak text which has been selected into the clipboard, or directly from the Konqueror browser or the Kate editor.
pt_pt: Nesse sentido, ele pode falar texto que foi selecionado para a área de transferência, ou diretamente do navegador Konqueror ou do editor Kate.

source: · Includes different Voices, whose characteristics can be altered.
pt_pt: · Inclui diferentes vozes, cujas características podem ser alteradas.

source: · Can produce speech output as a WAV file.
pt_pt: · Pode produzir saída de fala como um arquivo WAV.

source: · Can translate text to phoneme codes, so it could be adapted as a front end for another speech synthesis engine.
pt_pt: · Pode traduzir texto para códigos de fonemas, de modo que possa ser adaptado como uma interface para outro motor de síntese de voz.

source: · Potential for other languages.
pt_pt: · Potencial para outros idiomas.

source: Rudimentary (and probably humourous) attempts at German and Esperanto are included.
pt_pt: Tentativas ainda rudimentares (e provavelmente engraçadas) para o alemão e o esperanto estão incluídas.

source: · Compact size.
pt_pt: · Tamanho compacto.

source: The program and its data total about 350 kbytes.
pt_pt: O programa e seus dados somam por volta de 350 kbytes.

source: · Written in C++.
pt_pt: · Escrito em C++.

source: eSpeak can also be used with Speech Dispatcher.
pt_pt: eSpeak também pode ser usado com o Speech Dispatcher.

source: A small fast run-time speech synthesis engine.
pt_pt: Um motor de síntese de fala pequeno e de rápida execução.

source: It is the latest addition to the suite of free software synthesis tools including University of Edinburgh's Festival Speech Synthesis System and Carnegie Mellon University's FestVox project, tools, scripts and documentation for building synthetic voices.
pt_pt: É a última adição ao pacote de ferramentas livres de softwares de síntese, incluindo o Festival Speech Synthesis System da Universidade de Edinburgh e o projeto FestVox da Universidade Carnegie Mellon; além de ferramentas, scripts e documentação para construção de vozes sintéticas.

source: However, flite itself does not require either of these systems to run.
pt_pt: Contudo, o flite propriamente dito não requer nenhum desses sistemas para rodar.

source: It currently only supports the English language.
pt_pt: Atualmente só suporta a língua inglesa.

source: A general multi-lingual speech synthesis system developed at the CSTR [Centre for Speech Technology Research] of University of Edinburgh.
pt_pt: Um sistema genérico e multi-idioma de síntese de fala desenvolvido no CSTR [Centre for Speech Technology Research] da Universidade de Edinburgh.

source: Festival offers a full text to speech system with various APIs, as well an environment for development and research of speech synthesis techniques.
pt_pt: O Festival oferece um sistema completo de texto para fala com várias APIs, mas também um ambiente para desenvolvimento e pesquisa de técnicas de síntese de fala.

source: It is written in C++ with a Scheme-based command interpreter for general control.
pt_pt: É escrito em C++ com um interpretador de comando baseado em Scheme para controle geral.

source: Besides research into speech synthesis, festival is useful as a stand-alone speech synthesis program.
pt_pt: Além de pesquisa com síntese de fala, o Festival é útil como um programa autônomo de síntese de fala.

source: It is capable of producing clearly understandable speech from text.
pt_pt: Ele é capaz de produzir falas claramente compreensíveis dos textos.

source: Provides a device independent layer for speech synthesis.
pt_pt: Fornece uma camada independente de dispositivo para síntese de fala.

source: It supports various software and hardware speech synthesizers as backends and provides a generic layer for synthesizing speech and playing back PCM data via those different backends to applications.
pt_pt: Ele suporta vários softwares e hardwares de síntese de fala como backends e provê uma camada genérica para síntese de fala e para reprodução de dados PCM através daquelas diferentes backends para os aplicativos.

source: Various high level concepts like enqueueing vs. interrupting speech and application specific user configurations are implemented in a device independent way, therefore freeing the application programmer from having to yet again reinvent the wheel.
pt_pt: Muitos conceitos de alto nível como enfileiramento versus interrupção de fala, e configurações de usuário(a) específicas ao aplicativo, são implementados de uma maneira independente ao dispositivo; consequentemente liberando o(a) programador(a) do aplicativo de ter que reinventar a roda.

source: Internationalised Speech Synthesis
pt_pt: Síntese de fala internacionalizada

source: All the currently available free solutions for software based speech synthesis seem to share one common deficiency: They are mostly limited to English, providing only very marginal support for other languages, or in most cases none at all.
pt_pt: Todas as atuais soluções livres disponíveis para síntese de fala baseada em software parecem compartilhar uma deficiência comum: elas são restritas à língua inglesa, oferecendo somente suporte muito marginal aos outros idiomas; ou em muitos casos, não oferecendo suporte algum.

source: Among all the free software speech synthesizers for Linux, only CMU Festival supports more than one natural language.
pt_pt: Entre todos os softwares livres de síntese de fala para Linux, somente o CMU Festival suporta mais de uma língua natural.

source: CMU Festival can synthesize English, Spanish and Welsh.
pt_pt: O CMU Festival pode sintetizar inglês, espanhol e galês.

source: German is not supported.
pt_pt: Alemão não é suportado.

source: French is not supported.
pt_pt: Francês não é suportado.

source: Russian is not supported.
pt_pt: Russo não é suportado.

source: When internationalization and localization are the trends in software and web services, is it reasonable to require blind people interested in Linux to learn English just to understand their computer's output and to conduct all their correspondence in a foreign tongue?
pt_pt: Em um momento em que internacionalização e localização são tendências no mundo do software e dos serviços web, é razoável demandar que pessoas com deficiência visual interessadas no Linux tenham que aprender inglês somente para entender as saídas geradas pelo computador e para conduzir todas as suas ações em uma língua estrangeira?

source: Unfortunately, speech synthesis is not really Jane Hacker's favourite homebrew project.
pt_pt: Infelizmente, a síntese de fala não é o projeto preferido que a Jane Hacker (uma conhecida inventora) faz na casa dela.

source: Creating an intelligible software speech synthesizer involves time-consuming tasks.
pt_pt: Criar um software sintetizador de fala inteligível envolve tarefas que consomem tempo.

source: Concatenative speech synthesis requires the careful creation of a phoneme database containing all the possible combinations of sounds for the target language.
pt_pt: Síntese de fala por concatenação requer a criação cuidadosa de um banco de dados de fonemas contendo todas as possíveis combinações de som para um determinado idioma.

source: Rules that determine the transformation of the text representation into individual phonemes also need to be developed and fine-tuned, usually requiring the division of the stream of characters into logical groups such as sentences, phrases and words.
pt_pt: Regras que determinem a transformação da representação de texto em fonemas individuais também precisam ser desenvolvidas e detalhadamente ajustadas, geralmente demandando a divisão de sequências de caracteres em grupos lógicos como orações, frases e palavras.

source: Such lexical analysis requires a language-specific lexicon seldom released under a free license.
pt_pt: Tal análise lexicográfica requer um léxico específico ao idioma que raramente é lançado sob uma licença livre.

source: One of the most promising speech synthesis systems is Mbrola, with phoneme databases for over several dozen different languages.
pt_pt: Um dos mais promissores sistemas de síntese de fala é o Mbrola, com bancos de dados de fonemas para diversos idiomas.

source: The synthesis itself is free software.
pt_pt: A síntese propriamente dita é software livre.
